<template>
  <ion-page>
    <ion-header>
      <ion-toolbar>
        <ion-buttons slot="start">
          <ion-back-button @click="setClose" default-href="/"></ion-back-button>
        </ion-buttons>
        <ion-title class="ion-text-center">Audictionary</ion-title>
      </ion-toolbar>
    </ion-header>
    <ion-content>
      <div class="text-center my-6 text-xl font-bold">
        <span class="border-b-2 pb-1">개인정보 수집 및 이용에 대한 동의</span>
      </div>
      <div class="px-3 mb-10">
        <h4><strong>1. 개인정보 수집 및 이용 현황</strong></h4>
        <p>가. 회사는 서비스 제공을 위한 최소한의 범위 내에서 이용자의 동의 하에 개인정보를 수집하며, 수집한 모든 개인정보는 고지한 목적 범위 내에서만 사용됩니다. 또한, 제공하는 서비스(채용 정보제공 등) 특성상 「근로기준법」에 따라 만15세 미만인 경우 회원가입을 허용하지 않습니다. 회사에서 제공하는 서비스 유형에 따라 다음과 같이 개인정보를 수집, 이용, 보유 및 파기하고 있습니다.</p>
        <ul>
        <li>참고 사이트 : <a href="https://www.saramin.co.kr/zf_user/popup/clause-privacy?highlight=collectionAccess">https://www.saramin.co.kr/zf_user/popup/clause-privacy?highlight=collectionAccess</a></li>
        </ul>
        <p>(주) 미일 (이하 &#39;회사&#39;는) 고객님의 개인 정보를 중요시하며, &quot;정보 통신망 이용 촉진 및 정 보 보호&quot;에 관한 법률을 준수하고 있습니다. 회사는 개인 정보 취급 방침을 통하여 고객님 께서 제공하시는 개인 정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인 정보 보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다. </p>
        <p>회사는 개인 정보 취급 방침을 개정하는 경우 웹 사이트 공지 사항 (또는 개별 공지)을 통하여 공지 할 것입니다. </p>
        <ul>
        <li>본 방침은 : 2021 년 5 월 4 일부터 시행됩니다.</li>
        </ul>
        <p>■ 수집하는 개인 정보 항목 </p>
        <p>회사는 회원 가입, 상담, 서비스 신청 등등을 위해 아래와 같은 개인 정보를 수집하고 있습니다. </p>
        <ul>
        <li>수집 항목 : 이름, 생년월일, 성별, 로그인 ID, 비밀번호, 자택 주소, 휴대 전화 번호, 이메일, 프로필 작성시 입력하는 신체 정보 및 연기자 스타일 정보, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보, 결제 기록을</li>
        <li>개인 정보 수집 방법 : 홈페이지 (회원 가입, 아이디 비밀번호 확인, 고객 센터 메일 문의 등), 전화 / 팩스를 통 한 회원 가입</li>
        </ul>
        <p>■ 개인 정보의 수집 및 이용 목적 </p>
        <p>회사는 수집 한 개인 정보를 다음의 목적을 위해 활용합니다. </p>
        <ul>
        <li>회원 관리</li>
        </ul>
        <p>회원 관리 회원제 서비스 이용에 따른 본인 확인, 개인 식별, 불량 회원의 부정 이용 방지와 비인가 사용 방지, 가입의사 확인, 연령 확인, 만 14 세 미만 아동 개인 정보 수집시 법정 대리인 동의 여부 확인, 불만 처리 등 민원 처리, 고지 사항 전달 </p>
        <ul>
        <li>마케팅 및 광고에 활용</li>
        </ul>
        <p>신규 서비스 (제품) 개발 및 특화, 이벤트 등 광고성 정보 전달, 접속 빈도 파악 또는 회원의 서비스 이용에 대 한 통계 </p>
        <p>■ 개인 정보의 보유 및 이용 기간 </p>
        <p>회사는 개인 정보 수집 및 이용 목적이 달성 된 후에는 예외없이 해당 정보를 지체없이 파기합니다. </p>
        <p>■ 개인 정보의 파기 절차 및 방법 </p>
        <p>회사는 원칙적으로 개인 정보 수집 및 이용 목적이 달성 된 후에는 해당 정보를 지체없이 파기합니다. 파기 절차 및 방법은 다음과 같습니다. </p>
        <ul>
        <li>파기 절차</li>
        </ul>
        <p>회원님이 회원 가입 등을 위해 입력하신 정보는 목적이 달성 된 후 별도의 DB로 옮겨져 (종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 점보 보호 사유에 따라 (보유 및 이용 기간 참조) 일정 기간 저장된 후 파기되어집니다. </p>
        <p>별도 DB로 옮겨진 개인 정보는 법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용 되지 않습니다. </p>
        <ul>
        <li>파기 방법<ul>
        <li>전자적 파일 형태로 저장된 개인 정보는 기록을 재생할 수없는 기술적 방법을 사용하여 삭제합니다.</li>
        <li>종이에 출력 된 개인 정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.</li>
        </ul>
        </li>
        </ul>
        <p>■ 개인 정보 제공 </p>
        <p>회사는 이용자의 개인 정보를 원칙적으로 외부에 제공하지 않습니다. 다만, 아래의 경우에는 예외로합니다.</p>
        <ul>
        <li>이용자들이 사전에 동의 한 경우</li>
        <li>법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사 기관의 요구가있는 경우</li>
        </ul>
        <p>■ 수집 한 개인 정보의 위탁 회사는 고객님의 동의없이 고객님의 정보를 외부 업체에 위탁하지 않습니다. 향후 그러한 필요가 생길 경우, 위탁 대상자와 위탁 업무 내용에 대해 고객님에게 통지하고 필요한 경우 사전 동의를 받도록하겠습니다.</p>
        <p>■ 이용자 및 법정 대리인의 권리와 그 행사 방법 </p>
        <p>이용자 및 법정 대리인은 언제든지 등록되어있는 자신 혹은 당해 만 14 세 미만 아동의 개인 정보를 조회하거나 수정할 수 있으며 가입 해지를 요청할 수도 있습니다. </p>
        <p>이용자 혹은 만 14 세 미만 아동의 개인 정보 조회 / 수정을 위해서는 &#39;개인 정보 변경&#39;(또는 &#39;회원 정보 수정&#39;등)을 가입 해지 (동의 철회)를 위해서는&quot;회원 탈퇴 &quot;를 클릭하여 본인 확인 절차를 거치 신 후 직접 열람, 정정 또는 탈퇴가 가능합니다.</p>

      </div>
    </ion-content>
  </ion-page>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
  name: 'PrivacyPolicyTosPage',
  props:{
    modalController:{
      type: Object,
      required:true
    }
  },
  setup(props){
    function setClose(){
      props.modalController.dismiss();
    }
    return{
      setClose
    }
  }
})
</script>

<style scoped>
  p, ul, li {
    font-size: 13px;
  }

  ul, li {
    padding: 5px 0 5px 0;
  }
</style>